# SetAnalyticalAlignmentMethod Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSketchComponent..::..SetAnalyticalAlignmentMethod Method
AnalyticalModelSketchComponent Class See Also
---
Sets the Alignment Method to the supplied Analytical Alignment Method
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetAnalyticalAlignmentMethod(
	AnalyticalAlignmentMethod alignmentMethod
)
```

Visual Basic
---
```text
Public Sub SetAnalyticalAlignmentMethod ( _
	alignmentMethod As AnalyticalAlignmentMethod _
)
```

Visual C++
---
```text
public:
void SetAnalyticalAlignmentMethod(
	AnalyticalAlignmentMethod alignmentMethod
)
```

# ### Parameters
alignmentMethod
    Type: Autodesk.Revit.DB.Structure..::..AnalyticalAlignmentMethod Analytical Alignment Method which the Analytical Model should use for alignment.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | alignmentMethod is not valid for this Sketch component. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace